-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2019-07-01 03:54:21
-- 服务器版本： 10.1.28-MariaDB
-- PHP Version: 5.6.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tpp`
--

-- --------------------------------------------------------

--
-- 表的结构 `cinema_list`
--

CREATE TABLE `cinema_list` (
  `cid` int(11) NOT NULL,
  `cname` varchar(64) CHARACTER SET utf8 NOT NULL COMMENT '影院',
  `address` varchar(128) CHARACTER SET utf8 NOT NULL COMMENT '地址',
  `mapX` varchar(64) CHARACTER SET utf8 NOT NULL,
  `mapY` varchar(64) CHARACTER SET utf8 NOT NULL,
  `tell` varchar(16) CHARACTER SET utf8 NOT NULL COMMENT '电话',
  `mscore` int(11) DEFAULT NULL COMMENT '影院评分',
  `isRefund` tinyint(1) NOT NULL DEFAULT '1' COMMENT '退票',
  `isTicket` tinyint(1) NOT NULL DEFAULT '1' COMMENT '改签',
  `isCard` tinyint(1) NOT NULL DEFAULT '1' COMMENT '影城卡',
  `isFood` tinyint(1) NOT NULL DEFAULT '1' COMMENT '观影小食',
  `isIMAX` tinyint(1) NOT NULL DEFAULT '1' COMMENT 'IMAX厅',
  `isMPOS` tinyint(1) NOT NULL DEFAULT '1' COMMENT '刷卡',
  `ann` varchar(128) CHARACTER SET utf8 NOT NULL DEFAULT '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务' COMMENT '公告',
  `circum` varchar(128) CHARACTER SET utf8 NOT NULL DEFAULT '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客' COMMENT '周边设施',
  `msell` varchar(16) CHARACTER SET utf8 NOT NULL,
  `mdis` decimal(3,1) NOT NULL DEFAULT '19.9'
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- 转存表中的数据 `cinema_list`
--

INSERT INTO `cinema_list` (`cid`, `cname`, `address`, `mapX`, `mapY`, `tell`, `mscore`, `isRefund`, `isTicket`, `isCard`, `isFood`, `isIMAX`, `isMPOS`, `ann`, `circum`, `msell`, `mdis`) VALUES
(1, '华谊兄弟影院(光谷天地店)', '武汉市洪山区关山大道光谷天地F1区3楼 ', '114.416936', '30.481311', '13871577733 ', 92, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '小食特惠，最低7.9起', '28.9'),
(2, '武汉洪山天河国际影城(乐天城购物广场店)', '武汉洪山区珞瑜路4号群光广场旁乐天城8F ', '114.361117', '30.532086', '(027)87882649 ', 86, 0, 1, 1, 0, 0, 0, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '小食特惠，最低7.9起', '19.9'),
(3, '万达影城(武汉春树里店)', '武汉市武昌区中北路166号菩提金广场4层 ', '114.367285', '30.58129', '(027)88213677 ', 82, 0, 1, 1, 0, 1, 1, '国安法规批复撒鬼鬼', '武汉市武昌区中北路166号菩提金广场4层 ', '蜘蛛侠、英雄远征等2部影片特惠', '25.9'),
(4, '武商摩尔国际电影城(武汉国际广场)', '湖北省武汉市解放大道国际广场C座7楼 ', '114.278207', '30.585413', '027)85585588 ', 89, 1, 0, 1, 0, 1, 1, '湖北省武汉市解放大道国际广场C座7楼 ', '湖北省武汉市解放大道国际广场C座7楼 ', '小食特惠，最低7.9起', '19.9'),
(5, '中影星美国际影城(创意天地店)', '武汉市洪山区野芷湖西路16号', '114.328894', '30.47566', '(027)87803788 ', 89, 1, 0, 0, 1, 1, 0, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '蜘蛛侠、英雄远征等2部影片特惠', '32.0'),
(6, '武汉璇宫影城(江汉路店)', '湖北省武汉市江汉区江汉路57号璇宫饭店5层 ', '114.296442', '30.587256', '(027)82280809 ', 86, 1, 0, 0, 0, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '', '28.9'),
(7, '武汉金逸影城(江夏店)', '武汉市江夏区江夏大道与北华街交汇处九全嘉购物广场4楼 ', '114.336268', '30.364271', '(027)81787990 ', 86, 1, 1, 0, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '小食特惠，最低7.9折起', '19.9'),
(8, '万达影城(大泽东西湖中心广场店)', '武汉市东西湖区五环大道与东吴大道交界大泽东西湖中心广场 ', '114.144946', '30.629305', '(027)83243677 ', 85, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '蜘蛛侠、英雄远征等2部影片特惠', '26.8'),
(9, '中影国际影城(世界城光谷步行街店)', '谷步行街C区3楼 ', '114.409922', '30.510865', '(027)83243677 ', 84, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '蜘蛛侠、英雄远征等2部影片特惠', '19.9'),
(10, '万达影城(武汉长青广场店)', '武汉市江岸区黄兴路长青广场E座4楼 ', '114.303846', '30.596534', '(027)82791677 ', 8, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '蜘蛛侠、英雄远征等2部影片特惠', '24.8'),
(11, '武汉天河欢乐汇影城', '武汉市洪山区书城路18号欢乐汇5楼 ', '114.346101', '30.512465', '(027)87200010 ', 86, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '', '19.9'),
(12, '东澜岸天河国际影城', '青菱乡黄家湖西路福星惠誉东澜岸广场2层2室 ', '114.269752', '30.439503', '027)88861777 ', 86, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '', '19.9'),
(13, '金逸影城(中南店)', '武汉市武昌区武珞路440号中南国际城A座4楼 ', '114.33483', '30.540963', '027)87715855 ', 0, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '', '19.9'),
(14, '汉阳天河电影城(汉商21世纪购物中心店)', '武汉市汉阳区汉阳大道687号汉商21世纪购物中心F3 ', '114.21668', '30.5661', '(027)84675900', 87, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '', '19.9'),
(15, '汉阳天河电影城(汉商21世纪购物中心店)', '武汉市汉阳区汉阳大道687号汉商21世纪购物中心F3 ', '114.21668', '30.5661', '(027)84675900 ', 90, 0, 0, 1, 1, 1, 0, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '小食特惠，最低32元起', '32.0'),
(16, '中影国际影城(永旺梦乐城武汉经开店店)', '武汉市汉阳区江城大道388号永旺梦乐城F3 ', '114.210942', '30.507746', '(027)87332649 ', 84, 1, 1, 0, 0, 1, 0, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '小食特惠，最低7.9起', '19.9'),
(17, '新港国际影城', '武汉市蔡甸区博学路金色港湾商业楼3楼 ', '114.16129', '30.524251', '(027)84737717 ', 79, 1, 1, 0, 0, 1, 1, '国安法规批复撒鬼鬼', '武汉市武昌区中北路166号菩提金广场4层 ', '蜘蛛侠、英雄远征等2部影片特惠', '32.0'),
(18, '金逸影城(武汉摩尔城店)', '湖北省武汉市汉阳区王家湾龙阳大道6号摩尔城C栋5楼 ', '114.213448', '30.565207', '(027)84459599 ', 89, 1, 0, 1, 1, 1, 1, '湖北省武汉市汉阳区王家湾龙阳大道6号摩尔城C栋5楼 ', '汉阳区王家湾龙阳大道6号摩尔城C栋5楼 ', '小食特惠，最低7.9起', '34.9'),
(19, '纽宾凯环球影城', '芳草路97号纽宾凯麦德龙三楼 ', '114.212212', '30.538964', '(027)59261666 ', 89, 1, 0, 0, 0, 1, 0, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '蜘蛛侠、英雄远征等2部影片特惠', '32.0'),
(20, '中影星美浩瀚国际影城(铁桥店)', '湖北省武汉市汉阳区百灵路铁桥广场3楼 ', '114.232872', '30.569044', '(027)86180178 ', 87, 1, 1, 0, 0, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '', '35.0'),
(21, 'CGV影城(武汉江腾店)', '武汉市汉阳区马鹦路117号江腾广场4-5层 ', '114.232872', '30.569044', '(027)86780178 ', 85, 1, 1, 0, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '小食特惠，最低7.9折起', '29.9'),
(22, '万达影城(大泽东西湖中心广场店)', '武汉市东西湖区五环大道与东吴大道交界大泽东西湖中心广场 ', '114.144946', '30.629305', '(027)83243677 ', 85, 1, 1, 1, 1, 1, 1, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '蜘蛛侠、英雄远征等2部影片特惠', '26.8'),
(23, '武汉王家湾摩尔城青柠影咖', '湖北省武汉市汉阳区龙阳大道特6号摩尔城B座5楼 ', '114.214507', '30.565223', '(027)84777618 ', 84, 1, 1, 1, 1, 1, 0, '影院提供毛毯，儿童坐垫、消音耳塞、无线充电、医疗箱等贴心服务', '星巴克、沃尔玛、电玩城、热风、米乐星、DQ、肯德基、必胜客', '小食特惠，最低7.9起', '19.9');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cinema_list`
--
ALTER TABLE `cinema_list`
  ADD PRIMARY KEY (`cid`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `cinema_list`
--
ALTER TABLE `cinema_list`
  MODIFY `cid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=24;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
